kmeshcheryakov/amazon-freertos/demos/nordic/nrf52840-dk/common/application_code/aws_demo_nrf52dk.c
/*
 * Amazon FreeRTOS
 * Copyright (C) 2017 Amazon.com, Inc. or its affiliates.  All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * http://aws.amazon.com/freertos
 * http://www.FreeRTOS.org
 */

/**
 * @file aws_demo_nrf52dk.c
 * @brief Simple MQTT publish example.
 *
 * This application publishes MQTT "HelloWorld" messages to a topic using AWS Iot MQTT broker. It receives
 * acknowledgment packets from the broker and echoes back the message to the broker.
 *
 * The demo uses underlying network agnostic MQTT library to perform all MQTT operations. Hence the demo can
 * run over both a secured TCP/IP connection over WIFI network as well as over a secured BLE connection, using
 * a Mobile phone as MQTT proxy to the cloud.
 */
/* Standard includes. */
#include <stdbool.h>
#include <string.h>
#include <stdio.h>

/* Build using a config header, if provided. */
#include "iot_demo.h"

/*
 * FreeRTOS header includes
 */
#include "FreeRTOS.h"
#include "task.h"
#include "semphr.h"
#include "timers.h"
//#include "message_buffer.h"

/* MQTT library header includes */
#include "iot_mqtt.h"

/* POSIX and Platform layer includes. */
#include "platform/iot_clock.h"
#include "FreeRTOS_POSIX/time.h"
#include "FreeRTOS_POSIX/pthread.h"

/* Network connection includes */
#include "platform/iot_network_ble.h"
#include "aws_iot_demo_network.h"
#include "aws_iot_network_manager.h"
#include "aws_clientcredential.h"

/* Nordic BSP includes */
#include "bsp.h"
#include "nordic_common.h"
#include "sdk_errors.h"
#include "nrf_drv_wdt.h"
#include "nrf_drv_saadc.h"
#include "nrf_drv_timer.h"
#include "nrf_drv_clock.h"
#include "app_error.h"
#include "app_timer.h"

/*-----------------------------------------------------------*/

/* Amazon FreeRTOS OTA agent includes. */
#include "aws_ota_agent.h"

/* Required for demo task stack and priority */
#include "aws_ota_update_demo.h"
#include "iot_demo_config.h"
#include "aws_demo_config.h"
#include "aws_application_version.h"

#define otademoCONN_TIMEOUT_MS 2000UL

#define echoKEEPALIVE_SECONDS              ( 120 )

#define myappONE_SECOND_DELAY_IN_TICKS  pdMS_TO_TICKS( 1000UL )

static const char *pcStateStr[eOTA_NumAgentStates] =
{
     "Not Ready",
     "Ready",
     "Active",
     "Shutting down"
};

/*-----------------------------------------------------------*/

typedef struct Measurements {
    uint32_t temp;
    uint32_t humidity;
} xMeasurements_t;

/* Device states enumeration */
typedef enum
{
    eDeviceState_MQTT_Inactive = 0,
    eDeviceState_MQTT_WaitingForConnection,
    eDeviceState_MQTT_Disconnected,
    eDeviceState_MQTT_Connected,
} DeviceState_t;

/* LED definitions*/
#define LED_ONE                             BSP_LED_3_MASK
#define LED_TWO                             BSP_LED_1_MASK
#define LED_THREE                           BSP_LED_2_MASK
#define LED_FOUR                            BSP_LED_0_MASK
#define ALL_APP_LED                        (BSP_LED_0_MASK | BSP_LED_1_MASK | \
                                            BSP_LED_2_MASK | BSP_LED_3_MASK)            /**< Define used for simultaneous operation of all application LEDs. */
#define LED_BLINK_INTERVAL_MS               ( 300 )                                     /**< LED blinking interval. */

/* Timers definitions */
#define DEMO_TIMER_TICKS( MS )              ( ( uint32_t ) ROUNDED_DIV( ( MS ) * configTICK_RATE_HZ, 1000 ) )
#define TIMER_PERIOD_MS                     ( 1000 )
#define TIMER_RESOLUTION_IN_MS              ( 10 )                                      /**< Timer period. */
#define TIMER_FULL                          ( 0xFFFFFFFFUL )
#define TIMER_CONNECT                       ( 0 )       /* ms */
#define TIMER_PUBLISH                       ( 1 )       /* ms */
APP_TIMER_DEF(m_timer_tick_src_id);

/* Buttons definitions */
#define BUTTON_ONE                          ( 1 )
#define BUTTON_TWO                          ( 2 )
#define BUTTON_THREE                        ( 3 )
#define BUTTON_FOUR                         ( 4 )
#define BUTTON_DETECTION_DELAY              DEMO_TIMER_TICKS( 100 )

/* Minimum mesurement voltage */
#define MIN_VCC                             ( 2000 )    /* mV */

/**
 * @brief Dimension of the character array buffers used to hold data (strings in
 * this case) that is published to and received from the MQTT broker (in the cloud).
 */
#define demoDATA "%d"
#define demoMAX_DATA_LENGTH    ( 4 )
/* MQTT timeouts */
#define demoTIMEOUT_CONNECT                     ( 60000 )   /* ms */
#define demoTIMEOUT_PUBLISH                     ( 5000 )    /* ms */

/**
 * @brief The topic that the MQTT client both subscribes and publishes to.
 */
#define QUEUE_MSG_LENGTH                    ( 6 )

#define CLIENT_ID         ( clientcredentialIOT_THING_NAME )
//
///**
// * @brief The topic that the MQTT client both subscribes and publishes to.
// */
#define demoTOPIC_NAME         ( ( const uint8_t * ) "nrf52dk/"clientcredentialIOT_THING_NAME )

#define demoTOPIC_NAME_HEALTH  ( ( const uint8_t * ) "nrf52dk/"clientcredentialIOT_THING_NAME"/health" )

/**
 * @brief The string appended to messages that are echoed back to the MQTT broker.
 *
 * It is also used to detect if a received message has already been acknowledged.
 */
#define demoACK_STRING                     " ACK"

#define demoACK_LENGTH                     ( 4 )

