kmeshcheryakov/amazon-freertos/demos/nordic/nrf52840-dk/common/application_code/aws_demo_nrf52dk.c
#define demoMAX_ACK_MSG_LENGTH             ( demoMAX_DATA_LENGTH + demoACK_LENGTH )

#define demoQOS                            ( 0 )

#define demoKEEPALIVE_SECONDS              ( 120 )

#define demoNUM_MESSAGES                   ( 120 )

#define demoMSG_INTERVAL_SECONDS           ( 1 )

#define demoMQTT_TIMEOUT_MS                ( 5000 )

#define demoCONN_RETRY_INTERVAL_SECONDS    ( 5 )

#define demoCONN_RETRY_LIMIT               ( 100 )

#define demoTASK_STACK_SIZE                ( configMINIMAL_STACK_SIZE * 8 )

#define demoTASK_PRIORITY                  ( tskIDLE_PRIORITY + 1 )

#define demoCLEAR_ALL_BITS                 ( ( uint32_t ) 0xFFFFFFFFUL )

#define demoNETWORK_TYPES                  ( AWSIOT_NETWORK_TYPE_BLE )

#define echoPUBLISH_TIMEOUT_RETRIES        ( 2 )

/**
 * @brief Opens a new MQTT connection with the IOT broker endpoint.
 *
 * Function first creates a network connection which can either be a Bluetooth Low Energy connection with
 * a compatible device or a secure socket connection over WIFI. It then performs MQTT connect with the broker
 * endpoint, and subscribes to the demo topic configured.
 *
 * @return true if all the steps succeeded.
 */
IotMqttError_t prbOpenMqttConnection( void );
/**
 * @brief Closes an MQTT connection with the broker endpoint.
 *
 * Function first closes the MQTT connection with the broker by optionally (set in the parameter) sending a
 * DISCONNECT message to the broker. It also tears down the physical connectivity betweend the device and the
 * broker.
 *
 * @param bSendDisconnect[in] Should send a DISCONNECT message to the broker.
 */
void prvCloseMqttConnection( BaseType_t bSendDisconnect );
/**
 * @brief Publishes a message using QoS0 or QoS1 to the specified topic.
 *
 * @param pcMesg Pointer to the message
 * @param xLength Length of the message
 * @param pucTopicName is a name of MQTT Topic at Broker
 * @return AWS_IOT_MQTT_SUCCESS if the publish was successful.
 */
static IotMqttError_t prxPublishMessage( const char* pcMesg, size_t xLength, const uint8_t * pucTopicName );

/**
 * @brief Thread used to publish all the messages to the topic.
 * @param pvParam[in] Thread parameter
 */
static void prvPublishMessageTask( void* pvParam );

/**
 * @brief Creates and starts a publish message thread in detached state.
 * @return true if thread was started successfully.
 */
static BaseType_t prbStartPublishMessageTask( void );

/**
 * @brief Callback invoked when a disconnect event was received for the connection.
 *
 * @param xConnection The handle for the connection to the network.
 */
static IotNetworkError_t prvNetworkDisconnectCallback( void* pvContext );



/**
 * @brief Structure which holds the context for an MQTT connection within Demo.
 */
static MqttConnectionContext_t xConnection =
{
     .pvNetworkConnection = NULL,
     .ulNetworkType       = AWSIOT_NETWORK_TYPE_NONE,
     .xNetworkInfo        = IOT_MQTT_NETWORK_INFO_INITIALIZER,
     .xMqttConnection     = IOT_MQTT_CONNECTION_INITIALIZER,
     .xDisconnectCallback = prvNetworkDisconnectCallback
};


static void prvNetworkStateChangeCallback( uint32_t ulNetworkType, AwsIotNetworkState_t xNetworkState, void* pvContext );

static SubscriptionHandle_t xSubscriptionHandle = AWSIOT_NETWORK_SUBSCRIPTION_HANDLE_INITIALIZER;
/* Prepare timers */
/* #define demoUSE_ANTIFREEZE_TIMERS */
#ifdef demoUSE_ANTIFREEZE_TIMERS
static void timer_switch(uint32_t timer);
#endif

/* Initializes the board. */
static ret_code_t prvPeripheryInit( void );

/* Declaration of snprintf. The header stdio.h is not included because it
 * includes conflicting symbols on some platforms. */
extern int snprintf( char * pcS,
                     size_t xN,
                     const char * pcFormat,
                     ... );
/**
 * @brief Semaphore to indicate a new network is available.
 */
static SemaphoreHandle_t xNetworkAvailableLock = NULL;

/**
 * @brief Global variable used to indiacte if the underlying connection is active.
 */
static BaseType_t xConnected = pdFALSE;
/**
 * @brief Task Handle to notify of button have been pressed
 */
static TaskHandle_t xPublishMsgTaskHandle = NULL;

/* Mutex in order to concurrent update eDeviceState */
static SemaphoreHandle_t xDeviceStateMutex = NULL;

/* Device state to update led indication */
DeviceState_t eDeviceState = eDeviceState_MQTT_Inactive;

/* AntiFreeze Timers handlers */
#ifdef demoUSE_ANTIFREEZE_TIMERS
const nrf_drv_timer_t xTimer1 = NRF_DRV_TIMER_INSTANCE(1);
const nrf_drv_timer_t xTimer2 = NRF_DRV_TIMER_INSTANCE(2);
#endif

/* Watch Dog Timer channel ID */
nrf_drv_wdt_channel_id xWatchDogChannel;

/*-----------------------------------------------------------*/
static OTA_State_t eOtaState = eOTA_AgentState_NotReady;
static void App_OTACompleteCallback(OTA_JobEvent_t eEvent );

/* The OTA agent has completed the update job or determined that we're in
 * self test mode. If it was accepted, we want to activate the new image.
 * This typically means we should reset the device to run the new firmware.
 * If now is not a good time to reset the device, it may be activated later
 * by your user code. If the update was rejected, just return without doing
 * anything and we'll wait for another job. If it reported that we should
 * start test mode, normally we would perform some kind of system checks to
 * make sure our new firmware does the basic things we think it should do
 * but we'll just go ahead and set the image as accepted for demo purposes.
 * The accept function varies depending on your platform. Refer to the OTA
 * PAL implementation for your platform in aws_ota_pal.c to see what it
 * does for you.
 */

static void App_OTACompleteCallback( OTA_JobEvent_t eEvent )
{
	OTA_Err_t xErr = kOTA_Err_Uninitialized;
	
    if ( eEvent == eOTA_JobEvent_Activate )
    {
        configPRINTF( ( "Received eOTA_JobEvent_Activate callback from OTA Agent.\r\n" ) );
        OTA_ActivateNewImage();
    }
    else if (eEvent == eOTA_JobEvent_Fail)
    {
        configPRINTF( ( "Received eOTA_JobEvent_Fail callback from OTA Agent.\r\n" ) );
        /* Nothing special to do. The OTA agent handles it. */
    }
	else if (eEvent == eOTA_JobEvent_StartTest)
	{
		/* This demo just accepts the image since it was a good OTA update and networking
		 * and services are all working (or we wouldn't have made it this far). If this
		 * were some custom device that wants to test other things before calling it OK,
		 * this would be the place to kick off those tests before calling OTA_SetImageState()
		 * with the final result of either accepted or rejected. */
        configPRINTF( ( "Received eOTA_JobEvent_StartTest callback from OTA Agent.\r\n" ) );
	xErr = OTA_SetImageState (eOTA_ImageState_Accepted);
        if( xErr != kOTA_Err_None )
        {
            OTA_LOG_L1( " Error! Failed to set image state as accepted.\r\n" );    
        }
	}
}

static void prvNetworkStateChangeCallback( uint32_t ulNetworkType, AwsIotNetworkState_t xNetworkState, void* pvContext )
{
    if( xNetworkState == eNetworkStateEnabled )
    {
        /* Release the semaphore, to indicate other tasks that a network is available */
        xSemaphoreGive( xNetworkAvailableLock );
    }
    else if ( xNetworkState == eNetworkStateDisabled )
    {
       if( ( AwsIotNetworkManager_GetConnectedNetworks()
               & demoNETWORK_TYPES ) == AWSIOT_NETWORK_TYPE_NONE )
        {
            /* Take the semaphore if not taken already */
            xSemaphoreTake( xNetworkAvailableLock, 0 );
        }

        /* If the publish task is already connected to this network, set connected network flag to none,
         * to trigger a reconnect.
         */
        if( xConnection.ulNetworkType == ulNetworkType )
        {
            xConnected = pdFALSE;
        }
    }
}

static IotNetworkError_t prvNetworkDisconnectCallback( void* pvContext )
{
    ( void ) pvContext;
    xConnected = pdFALSE;
    BaseType_t lHigherPriorityTaskWoken = pdFALSE;
    
    xSemaphoreTakeFromISR( xDeviceStateMutex, &lHigherPriorityTaskWoken );
    eDeviceState = eDeviceState_MQTT_Disconnected;
    xSemaphoreGiveFromISR( xDeviceStateMutex, &lHigherPriorityTaskWoken );
    portEND_SWITCHING_ISR( lHigherPriorityTaskWoken );

    return IOT_NETWORK_SUCCESS;
}

/*-----------------------------------------------------------*/

static void prvOnNetworkDisconnect( void* xConnection )
{
    ( void ) xConnection;
    
