kmeshcheryakov/amazon-freertos/demos/nordic/nrf52840-dk/common/application_code/aws_demo_nrf52dk.c
}

/*-----------------------------------------------------------*/

IotMqttError_t prxPublishMessage( const char* pcMesg, size_t xLength, const uint8_t * pucTopicName )
{
    IotMqttPublishInfo_t xPublishInfo = IOT_MQTT_PUBLISH_INFO_INITIALIZER;
    IotMqttReference_t xOperationLock = IOT_MQTT_REFERENCE_INITIALIZER;
    IotMqttError_t xStatus;

    xPublishInfo.qos = demoQOS;
    xPublishInfo.pTopicName = pucTopicName;
    xPublishInfo.topicNameLength = strlen( pucTopicName );

    xPublishInfo.pPayload = ( void * ) pcMesg;
    xPublishInfo.payloadLength = xLength;
    xPublishInfo.retryLimit = 0;
    xPublishInfo.retryMs = 0;

    if( demoQOS == 0 )
    {
        xStatus = IotMqtt_Publish( xConnection.xMqttConnection,
                                   &xPublishInfo,
                                   0,
                                   NULL,
                                   NULL );
    }
    else if( demoQOS == 1 || demoQOS == 2 )
    {
        xStatus = IotMqtt_Publish( xConnection.xMqttConnection,
                                   &xPublishInfo,
                                   IOT_MQTT_FLAG_WAITABLE,
                                   NULL,
                                   &xOperationLock );
        
        if( xStatus == IOT_MQTT_STATUS_PENDING )
        {
            xStatus = IotMqtt_Wait( xOperationLock, demoMQTT_TIMEOUT_MS );
        }
    }

    return xStatus;
}

/*-----------------------------------------------------------*/

static BaseType_t prxCreateNetworkConnection( void )
{

    BaseType_t xRet = pdFALSE;

    /* If no networks are available, block for a physical network connection */
    if( ( AwsIotNetworkManager_GetConnectedNetworks() & demoNETWORK_TYPES ) == 0 )
    {
        /* Block for a Network Connection. */
        IotLogInfo( "Waiting for a network connection.");
        xSemaphoreTake( xNetworkAvailableLock, portMAX_DELAY );
    }

    /* At least one network type is available. Connect to the network type. */
    xRet = xMqttDemoCreateNetworkConnection(
            &xConnection,
            demoNETWORK_TYPES,
            demoCONN_RETRY_INTERVAL_SECONDS,
            demoCONN_RETRY_LIMIT );

    return xRet;
}


static BaseType_t prxReCreateConnection( void )
{
    vMqttDemoDeleteNetworkConnection( &xConnection );
    return prxCreateNetworkConnection();
}

static IotMqttError_t prxOpenMqttConnection()
{
    IotMqttConnectInfo_t xConnectInfo = IOT_MQTT_CONNECT_INFO_INITIALIZER;
    IotMqttError_t xMqttStatus;

    xSemaphoreTake( xDeviceStateMutex, portMAX_DELAY );
    eDeviceState = eDeviceState_MQTT_WaitingForConnection;
    xSemaphoreGive( xDeviceStateMutex );


    if( xConnection.ulNetworkType == AWSIOT_NETWORK_TYPE_BLE )
    {
        xConnectInfo.awsIotMqttMode = false;
        xConnectInfo.keepAliveSeconds = 0;
    }
    else
    {
        xConnectInfo.awsIotMqttMode = true;
        xConnectInfo.keepAliveSeconds = demoKEEPALIVE_SECONDS;
    }

    xConnectInfo.cleanSession = true;
    xConnectInfo.clientIdentifierLength = strlen( clientcredentialIOT_THING_NAME );
    xConnectInfo.pClientIdentifier = clientcredentialIOT_THING_NAME;

    /* Connect to the IoT broker endpoint */
    xMqttStatus = IotMqtt_Connect(
    		 &( xConnection.xNetworkInfo ),
                 &xConnectInfo,
                 demoMQTT_TIMEOUT_MS,
                 &( xConnection.xMqttConnection ));


    if( xMqttStatus != IOT_MQTT_SUCCESS )
    {
        /* Close the MQTT connection to perform any cleanup */
        prvCloseMqttConnection( pdFALSE );
    }
    else
    {
        xSemaphoreTake( xDeviceStateMutex, portMAX_DELAY );
        eDeviceState = eDeviceState_MQTT_Connected;
        xSemaphoreGive( xDeviceStateMutex );
        if( eOtaState == eOTA_AgentState_NotReady )
        {
            eOtaState = OTA_AgentInit( xConnection.xMqttConnection, ( const uint8_t * ) ( clientcredentialIOT_THING_NAME ), App_OTACompleteCallback, ( TickType_t ) ~0 );
            if( eOtaState != eOTA_AgentState_Ready )
            {
                IotLogError( "Failed to Activate OTA agent\r\n" );
            }
        }
    }

    return xMqttStatus;
}

void prvCloseMqttConnection( BaseType_t xCleanupOnly )
{
    xSemaphoreTake( xDeviceStateMutex, portMAX_DELAY );
    eDeviceState = eDeviceState_MQTT_Disconnected;
    xSemaphoreGive( xDeviceStateMutex );
    
    eOtaState = OTA_AgentShutdown( myappONE_SECOND_DELAY_IN_TICKS );
    if( eOtaState != eOTA_AgentState_NotReady )
    {
        IotLogError( "Could not shutdown OTA Agent\r\n" );
    }

    /* Close the MQTT connection either by sending a DISCONNECT operation or not */
    if( xConnection.xMqttConnection != IOT_MQTT_CONNECTION_INITIALIZER )
    {
        IotMqtt_Disconnect( xConnection.xMqttConnection, xCleanupOnly );
        xConnection.xMqttConnection = IOT_MQTT_CONNECTION_INITIALIZER;
    }
}

/*-----------------------------------------------------------*/

static void prvPublishMessageTask( void* pvParam )
{
    UNUSED_VARIABLE( pvParam );
    uint32_t ulButton;
    BaseType_t xResult;
    IotMqttError_t xError = IOT_MQTT_SUCCESS;
    char cMessage[ demoMAX_DATA_LENGTH ];
    size_t xMessageLength;
    uint32_t ulPublishRetriesLeft = echoPUBLISH_TIMEOUT_RETRIES;

    const TickType_t xPublishMsgPeriod = pdMS_TO_TICKS( 2000 );

    /* TODO: UNCOMMENT FOLLOWING */
    xConnected = prxCreateNetworkConnection();

    if( xConnected )
    {
        /* Open an MQTT connection */
        xError = prxOpenMqttConnection();
        if( xError == IOT_MQTT_SUCCESS )
        {
            for( ; ; )
            {
                /* Wait for a button is pressed notification for a xPublishMsgPeriod. */
                /* If it's not occurred, proceed with default value to HEALTH topic */
                /* and clear notification value at exit */
                xResult = xTaskNotifyWait( 0, demoCLEAR_ALL_BITS, &ulButton, xPublishMsgPeriod );
        
                xMessageLength = snprintf( cMessage, demoMAX_DATA_LENGTH, demoDATA, ulButton );
        
