kmeshcheryakov/amazon-freertos/demos/nordic/nrf52840-dk/common/application_code/aws_demo_nrf52dk.c
                /* Reset to default value */
                ulButton = 0;
        
                if( xConnected )
                {
                    if( xResult == pdPASS )
                    {
                        xError = prxPublishMessage( cMessage, xMessageLength, demoTOPIC_NAME );
                    }
                    else
                    {
                        xError = prxPublishMessage( cMessage, xMessageLength, demoTOPIC_NAME_HEALTH );
                    }

                    if( xError ==  IOT_MQTT_SUCCESS )
                    {
                        IotLogInfo( "Published Message: %.*s.", xMessageLength, cMessage );
                    }
                    else if( ( xError == IOT_MQTT_NETWORK_ERROR  )
                            || ( xError == IOT_MQTT_TIMEOUT ) )
                    {
                        IotLogInfo( "Published failed, reason: %s.",  IotMqtt_strerror( xError ) );

                        if( ulPublishRetriesLeft > 0 )
                        {
                            ulPublishRetriesLeft--;
                            IotLogInfo( "Retrying publish, Number of retries left before reconnecting: %d.", ulPublishRetriesLeft );
                        }
                        else
                        {
                            /* Set connected network to none to trigger a reconnection, as at this point we assume network is dead */
                            IotLogInfo( "Retry failed %d times, recreating the network connection.",echoPUBLISH_TIMEOUT_RETRIES );
                            xConnected = pdFALSE;
                        }
                    }
                    else
                    {
                        IotLogError( "Publish failed due to reason: %s, exiting demo.", IotMqtt_strerror( xError ) );
                        break;
                    }

                    eOtaState = OTA_GetAgentState();
                    if( ( eOtaState == eOTA_AgentState_Ready ) || ( eOtaState == eOTA_AgentState_Active ) )
                    {
                        configPRINTF( ( "State: %s  Received: %u   Queued: %u   Processed: %u   Dropped: %u\r\n", 
                                      pcStateStr[eOtaState],
                                      OTA_GetPacketsReceived(), 
                                      OTA_GetPacketsQueued(), 
                                      OTA_GetPacketsProcessed(), 
                                      OTA_GetPacketsDropped() ) );
                    }
                }
                else
                {
                    /* Recreate the Network Connection */
                    prvCloseMqttConnection( pdTRUE );
                    xConnected = prxReCreateConnection();

                    /* Create an MQTT connection over the network connection */
                    xError = prxOpenMqttConnection();
                    if( xError != IOT_MQTT_SUCCESS )
                    {
                        IotLogError("Failed to create an MQTT connection.");
                        break;
                    }
                }
            }
        }
        else
        {
            IotLogError("Failed to create an MQTT connection.");
        }

        if( xError == IOT_MQTT_SUCCESS )
        {
            IotLogInfo( "Demo successful" );
            prvCloseMqttConnection( pdFALSE );
        }
    }
    else
    {
        IotLogError("Failed to create a network connection.");
    }

    if( xConnected )
    {
        vMqttDemoDeleteNetworkConnection( &xConnection );
    }
    vSemaphoreDelete( xNetworkAvailableLock );
    vTaskDelete( NULL );
}

/*---------------------------------------------------------------------------------*/

static BaseType_t prbStartPublishMessageTask( void )
{
    ret_code_t xErrCode = NRF_SUCCESS;
    BaseType_t xRet = pdTRUE;
    xDeviceStateMutex = xSemaphoreCreateMutex();

    xErrCode = prvPeripheryInit();
    APP_ERROR_CHECK( xErrCode );

    if( demoNETWORK_TYPES == AWSIOT_NETWORK_TYPE_NONE )
    {
        IotLogError(( "There are no networks configured for the demo." ));
        xRet = pdFALSE;
    }

    if( xRet == pdTRUE )
    {
        xNetworkAvailableLock = xSemaphoreCreateBinary();
        if( xNetworkAvailableLock == NULL )
        {
            IotLogError(( "Failed to create semaphore." ));
            xRet = pdFALSE;
        }
    }

    if( xRet == pdTRUE )
    {
        xRet = AwsIotNetworkManager_SubscribeForStateChange( demoNETWORK_TYPES, 
                                                             prvNetworkStateChangeCallback, 
                                                             NULL, 
                                                             &xSubscriptionHandle );
        if( xRet == pdFALSE )
        {
            IotLogError(( "Failed to create Network Manager subscription." ));
        }
    }

    if( xRet == pdTRUE )
    {
        xRet = xTaskCreate( prvPublishMessageTask,
                            "MQTT_DEMO",
                            demoTASK_STACK_SIZE,
                            NULL,
                            demoTASK_PRIORITY, //democonfigMQTT_ECHO_TASK_PRIORITY,
                            &xPublishMsgTaskHandle );

        if( xRet == pdFALSE )
        {
            IotLogError(( "Failed to subscribe for network state change callback." ));
        }

    }

    if( xRet == pdFALSE )
    {
        xErrCode = NRF_ERROR_INTERNAL;

        if( xSubscriptionHandle != AWSIOT_NETWORK_SUBSCRIPTION_HANDLE_INITIALIZER )
        {
            AwsIotNetworkManager_RemoveSubscription( xSubscriptionHandle );
        }

        if( xNetworkAvailableLock != NULL )
        {
            vSemaphoreDelete( xNetworkAvailableLock );
        }
    }

    return xErrCode;
}

/*-----------------------------------------------------------*/

void vStartMQTTBLESensorsDemo( void )
{
    if( prbStartPublishMessageTask() != NRF_SUCCESS )
    {
        IotLogInfo( "Failed to create task for publish measurements");
    }
}
/*-----------------------------------------------------------*/

/**@brief Saadc callback.
 *
 * @param[in]   p_event   The event of the saadc triggered the callback.
 */
void saadc_callback(nrf_drv_saadc_evt_t const * p_event)
{
    if(p_event->type == NRF_DRV_SAADC_EVT_DONE)
    {
        /*
        * Do nothing
        */
    }
    if(p_event->type == NRF_DRV_SAADC_EVT_LIMIT)
    {
        /*
        * Do nothing
        */
    }
}
/*-----------------------------------------------------------*/

/**
 * @brief WDT events handler.
 */
void wdt_event_handler(void)
{
    LEDS_OFF(ALL_APP_LED);
}
/*-----------------------------------------------------------*/

/**@brief Function for the LEDs initialization.
 *
 * @details Initializes all LEDs used by this application.
 */
static void leds_init(void)
{
    // Configure application LED pins.
    LEDS_CONFIGURE(ALL_APP_LED);

    // Turn off all LED on initialization.
    LEDS_OFF(ALL_APP_LED);

    LEDS_ON(LED_FOUR);
}
/*-----------------------------------------------------------*/

/**
 * @brief Timer callback used for controlling board LEDs to represent application state.
 */
static void blink_timeout_handler()
{
    int32_t vcc;
    nrf_saadc_value_t saadc_sample;

