kmeshcheryakov/amazon-freertos/demos/nordic/nrf52840-dk/common/application_code/aws_demo_nrf52dk.c
    switch ( eDeviceState )
    {
        case eDeviceState_MQTT_Inactive:
            ;
        case eDeviceState_MQTT_Disconnected:
            LEDS_OFF(ALL_APP_LED);
            break;

        case eDeviceState_MQTT_WaitingForConnection:
            #ifdef demoUSE_ANTIFREEZE_TIMERS
            timer_switch( (uint32_t) TIMER_CONNECT );
            #endif
            LEDS_INVERT( LED_ONE );
            break;

        case eDeviceState_MQTT_Connected:
            #ifdef demoUSE_ANTIFREEZE_TIMERS
            timer_switch( (uint32_t) TIMER_PUBLISH );
            #endif
            LEDS_ON( LED_ONE );
            break;

        default:
            break;
    }

    nrf_drv_saadc_sample_convert( 0, &saadc_sample);
    /*
     * Resolusion of ADC - 10 bit, with maximum value 3600mV
     * 1023 - 3600
     *    0 -    0
     */
    vcc = saadc_sample * 3600 / 1023;
    /* configPRINTF( ( "VCC SAMPLE: %d\r\n", vcc ) ); */
    
    if( vcc < MIN_VCC )
    {
        LEDS_INVERT( LED_THREE );
    }

    nrf_drv_wdt_feed();
}
/*-----------------------------------------------------------*/

/**@brief Buttons event handler.
 *
 * @param[in]   pin_no   Button number.
 * @param[in]   button_action   Button action.
 */
static void button_event_handler(uint8_t pin_no, uint8_t button_action)
{
    BaseType_t lHigherPriorityTaskWoken = pdFALSE;
    eNotifyAction eAction = eSetValueWithoutOverwrite;
    uint32_t ulButton;

    LEDS_INVERT( LED_FOUR );

    if (button_action == APP_BUTTON_PUSH)
    {
        switch (pin_no)
        {
            case BSP_BUTTON_2:
                ulButton = BUTTON_ONE;
                break;

            case BSP_BUTTON_3:
                ulButton = BUTTON_TWO;
                break;

            case BSP_BUTTON_0:
                ulButton = BUTTON_THREE;
                break;

            case BSP_BUTTON_1:
                ulButton = BUTTON_FOUR;
                break;

            default:
                break;
        }

        UNUSED_VARIABLE( xTaskNotifyFromISR( xPublishMsgTaskHandle,
                                         ulButton,
                                         eAction,
                                         &lHigherPriorityTaskWoken ) );
    }
    portEND_SWITCHING_ISR( lHigherPriorityTaskWoken );
}
/*-----------------------------------------------------------*/

/**
 * @brief Initializes the buttons.
 * 
 * @return   NRF_SUCCESS on success, otherwise an error code.
 */
static ret_code_t button_init(void)
{
    ret_code_t err_code = NRF_SUCCESS;

    static app_button_cfg_t buttons[] =
    {
        { BSP_BUTTON_0, false, BUTTON_PULL, button_event_handler },
        { BSP_BUTTON_1, false, BUTTON_PULL, button_event_handler },
        { BSP_BUTTON_2, false, BUTTON_PULL, button_event_handler },
        { BSP_BUTTON_3, false, BUTTON_PULL, button_event_handler },
    };

    err_code = app_button_init(buttons, sizeof(buttons) / sizeof(buttons[0]), BUTTON_DETECTION_DELAY );
    APP_ERROR_CHECK(err_code);

    err_code = app_button_enable();
    APP_ERROR_CHECK(err_code);

    return  err_code;
}
/*-----------------------------------------------------------*/

/**@brief Function for updating the wall clock of the Timer module.
 *
 * @param[in]   p_context   Pointer used for passing context. No context used in this application.
 */
static void timer_tick_callback(void * p_context)
{
    UNUSED_VARIABLE(p_context);
    blink_timeout_handler();
}
/*-----------------------------------------------------------*/

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 * 
 * @return   NRF_SUCCESS on success, otherwise an error code.
 */
static ret_code_t timers_init(void)
{
    ret_code_t err_code = NRF_SUCCESS;

    // Initialize timer module.
    APP_ERROR_CHECK(app_timer_init());

    // Create a sys timer.
    err_code = app_timer_create(&m_timer_tick_src_id,
                                APP_TIMER_MODE_REPEATED,
                                timer_tick_callback);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_start(m_timer_tick_src_id,
                               DEMO_TIMER_TICKS( TIMER_PERIOD_MS ),
                               NULL);

    APP_ERROR_CHECK(err_code);

    return  err_code;
}
/*-----------------------------------------------------------*/

/**
 * @brief Initializes the wdt.
 * 
 * @return   NRF_SUCCESS on success, otherwise an error code.
 */
static ret_code_t wdt_init(void)
{
    ret_code_t err_code = NRF_SUCCESS;

    nrf_drv_wdt_config_t config = NRF_DRV_WDT_DEAFULT_CONFIG;
    err_code = nrf_drv_wdt_init(&config, wdt_event_handler);
    APP_ERROR_CHECK(err_code);
    err_code = nrf_drv_wdt_channel_alloc(&xWatchDogChannel);
    APP_ERROR_CHECK(err_code);
    nrf_drv_wdt_enable();

    return  err_code;
}
/*-----------------------------------------------------------*/

/**
 * @brief Initializes the saadc.
 * 
 * @return   NRF_SUCCESS on success, otherwise an error code.
 */
static ret_code_t saadc_init( void )
{
    ret_code_t err_code = NRF_SUCCESS;

    nrf_saadc_channel_config_t channel_config =
    NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE( NRF_SAADC_INPUT_VDD );

    err_code = nrf_drv_saadc_init( NULL, saadc_callback );
    APP_ERROR_CHECK( err_code );

    err_code = nrf_drv_saadc_channel_init( 0, &channel_config );
    APP_ERROR_CHECK( err_code );

    /*
     * Resolusion of ADC - 10 bit, with maximum value 3600mV
     * 1023 - 3600
     *    0 -    0
     */
    nrf_drv_saadc_limits_set( 0, MIN_VCC * 1023 / 3600, NRF_DRV_SAADC_LIMITH_DISABLED - 1 );

    return err_code;
}
/*-----------------------------------------------------------*/

/**
 * @brief Timers switch used to monitor the connection and publish. There is only one timer running at a time.
 *
 * @param[in]   timer   The number of the timer, which must be ON.
 */
#ifdef demoUSE_ANTIFREEZE_TIMERS
void timer_switch( uint32_t timer )
{
    if( ( timer == TIMER_CONNECT ) && nrf_drv_timer_is_enabled( &xTimer2 ) )
    {
        nrf_drv_timer_disable( &xTimer2 );
        nrf_drv_timer_clear( &xTimer1 );
        nrf_drv_timer_enable( &xTimer1 );
    }
    else if( ( timer == TIMER_PUBLISH ) && nrf_drv_timer_is_enabled( &xTimer1 ) )
    {
        nrf_drv_timer_disable( &xTimer1 );
        nrf_drv_timer_clear( &xTimer2 );
        nrf_drv_timer_enable( &xTimer2 );
    }
}
#endif
/*-----------------------------------------------------------*/

/**
 * @brief Timer driver event handler type.
 *
 * @param[in] event_type Timer event.
 * @param[in] p_context  General purpose parameter set during initialization of
 *                       the timer. This parameter can be used to pass
 *                       additional information to the handler function, for
 *                       example, the timer ID.
 */
 #ifdef demoUSE_ANTIFREEZE_TIMERS
void timer_event_handler(nrf_timer_event_t event_type, void* p_context)
{
    UNUSED_PARAMETER(p_context);
    
    switch (event_type)
    {
        case NRF_TIMER_EVENT_COMPARE0:
            /*When the timer channel compare 0 interrupt is triggered, the system soft reset is performed.*/
            NVIC_SystemReset();
            break;

        default:
            //Do nothing.
            break;
    }
}
#endif
/*-----------------------------------------------------------*/
#ifdef demoUSE_ANTIFREEZE_TIMERS
static ret_code_t init_timer(nrf_drv_timer_t const * const p_instance, uint32_t time_ms)
{
    uint32_t time_ticks;
    uint32_t err_code = NRF_SUCCESS;

