kmeshcheryakov/amazon-freertos/demos/nordic/nrf52840-dk/common/application_code/aws_demo_nrf52dk.c
    //Configure TIMER_LED for generating simple light effect - leds on board will invert his state one after the other.
    nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
    err_code = nrf_drv_timer_init(p_instance, &timer_cfg, timer_event_handler);
    APP_ERROR_CHECK(err_code);

    time_ticks = nrf_drv_timer_ms_to_ticks(p_instance, time_ms);

    nrf_drv_timer_extended_compare(
         p_instance, NRF_TIMER_CC_CHANNEL0, time_ticks, NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, true);

    return err_code;
}
#endif
/*-----------------------------------------------------------*/

/**
 * @brief Initializes the board.
 */
static ret_code_t prvPeripheryInit( void )
{
    ret_code_t err_code = NRF_SUCCESS;

    leds_init();

    /* Timer for update leds and feed WatchDog */
    err_code = timers_init();
    APP_ERROR_CHECK(err_code);

    err_code = button_init();
    APP_ERROR_CHECK(err_code);

#ifdef demoUSE_ANTIFREEZE_TIMERS
    err_code = init_timer(&xTimer1, demoTIMEOUT_CONNECT);
    APP_ERROR_CHECK(err_code);
    nrf_drv_timer_enable(&xTimer1);

    err_code = init_timer(&xTimer2, demoTIMEOUT_PUBLISH);
    APP_ERROR_CHECK(err_code);
#endif

    //Configure WDT.
    err_code = wdt_init();
    APP_ERROR_CHECK(err_code);

    err_code = saadc_init();
    APP_ERROR_CHECK(err_code);

    return err_code;
}
///*-----------------------------------------------------------*/
//
///**@brief Main print function.
// *
// * @param[in] pcString   Pointer to the data.
// */
///* configUSE_STATIC_ALLOCATION is set to 1, so the application must provide an
// * implementation of vApplicationGetIdleTaskMemory() to provide the memory that is
// * used by the Idle task. */
//void vApplicationGetIdleTaskMemory( StaticTask_t ** ppxIdleTaskTCBBuffer,
//                                    StackType_t ** ppxIdleTaskStackBuffer,
//                                    uint32_t * pulIdleTaskStackSize )
//{
//    /* If the buffers to be provided to the Idle task are declared inside this
//     * function then they must be declared static - otherwise they will be allocated on
//     * the stack and so not exists after this function exits. */
//    static StaticTask_t xIdleTaskTCB;
//    static StackType_t uxIdleTaskStack[ configMINIMAL_STACK_SIZE ];
//
//    /* Pass out a pointer to the StaticTask_t structure in which the Idle
//     * task's state will be stored. */
//    *ppxIdleTaskTCBBuffer = &xIdleTaskTCB;
//
//    /* Pass out the array that will be used as the Idle task's stack. */
//    *ppxIdleTaskStackBuffer = uxIdleTaskStack;
//
//    /* Pass out the size of the array pointed to by *ppxIdleTaskStackBuffer.
//     * Note that, as the array is necessarily of type StackType_t,
//     * configMINIMAL_STACK_SIZE is specified in words, not bytes. */
//    *pulIdleTaskStackSize = configMINIMAL_STACK_SIZE;
//}
///*-----------------------------------------------------------*/
//
///* configUSE_STATIC_ALLOCATION is set to 1, so the application must provide an
// * implementation of vApplicationGetTimerTaskMemory() to provide the memory that is
// * used by the RTOS daemon/time task. */
//void vApplicationGetTimerTaskMemory( StaticTask_t ** ppxTimerTaskTCBBuffer,
//                                     StackType_t ** ppxTimerTaskStackBuffer,
//                                     uint32_t * pulTimerTaskStackSize )
//{
//    /* If the buffers to be provided to the Timer task are declared inside this
//     * function then they must be declared static - otherwise they will be allocated on
//     * the stack and so not exists after this function exits. */
//    static StaticTask_t xTimerTaskTCB;
//    static StackType_t uxTimerTaskStack[ configTIMER_TASK_STACK_DEPTH ];
//
//    /* Pass out a pointer to the StaticTask_t structure in which the Idle
//     * task's state will be stored. */
//    *ppxTimerTaskTCBBuffer = &xTimerTaskTCB;
//
//    /* Pass out the array that will be used as the Timer task's stack. */
//    *ppxTimerTaskStackBuffer = uxTimerTaskStack;
//
//    /* Pass out the size of the array pointed to by *ppxTimerTaskStackBuffer.
//     * Note that, as the array is necessarily of type StackType_t,
//     * configMINIMAL_STACK_SIZE is specified in words, not bytes. */
//    *pulTimerTaskStackSize = configTIMER_TASK_STACK_DEPTH;
//}
///*-----------------------------------------------------------*/
//
///**
// * @brief ResetsWhen the timer channel 0 interrupt is triggered, the system soft reset is performed. the device if pvPortMalloc fails.
// *
// * Called if a call to pvPortMalloc() fails because there is insufficient
// * free memory available in the FreeRTOS heap.  pvPortMalloc() is called
// * internally by FreeRTOS API functions that create tasks, queues, software
// * timers, and semaphores.  The size of the FreeRTOS heap is set by the
// * configTOTAL_HEAP_SIZE configuration constant in FreeRTOSConfig.h.
// *
// */
//void vApplicationMallocFailedHook()
//{
//    /* vApplicationMallocFailedHook() will only be called if
//    configUSE_MALLOC_FAILED_HOOK is set to 1 in FreeRTOSConfig.h.  It is a hook
//    function that will get called if a call to pvPortMalloc() fails.
//    pvPortMalloc() is called internally by the kernel whenever a task, queue,
//    timer or semaphore is created.  It is also called by various parts of the
//    demo application.  If heap_1.c or heap_2.c are used, then the size of the
//    heap available to pvPortMalloc() is defined by configTOTAL_HEAP_SIZE in
//    FreeRTOSConfig.h, and the xPortGetFreeHeapSize() API function can be used
//    to query the size of free heap space that remains (although it does not
//    provide information on how the remaining heap might be fragmented). */
//
//    configPRINTF( ( "ERROR: Malloc failed to allocate memory\r\n" ) );
//    NVIC_SystemReset();
//}

//
///*-----------------------------------------------------------*/
///**
// * @brief Creates an MQTT client and then connects to the MQTT broker.
// *
// * The MQTT broker end point is set by clientcredentialMQTT_BROKER_ENDPOINT.
// *
// * @return pdPASS if everything is successful, pdFAIL otherwise.
// */
//static BaseType_t prvCreateClientAndConnectToBroker( void );
//
///**
// * @brief The callback registered with the MQTT client to get notified when
// * data is received from the broker.
// *
// * @param[in] pvUserData User data as supplied while registering the callback.
// * @param[in] pxCallbackParams Data received from the broker.
// *
// * @return Indicates whether or not we take the ownership of the buffer containing
// * the MQTT message. We never take the ownership and always return eMQTTFalse.
// */
//static BaseType_t prvMQTTCallback( void * pvUserData,
//                                   const MQTTAgentCallbackParams_t * const pxCallbackParams )
//{
//    BaseType_t xTakeOwnership = pdFALSE;
//    MQTTAgentReturnCode_t xReturnCode;
//
//    /* Remove compiler warnings about unused parameters. */
//    ( void ) pvUserData;
//
//    switch( pxCallbackParams->xMQTTEvent )
//    {
//        case eMQTTAgentDisconnect:
//            iLEDSState = eDeviceState_LEDS_MQTT_Disconnected;
//            iConnectionState = 0;
//            configPRINTF( ( "MQTT Client got disconnected.\r\n" ) );
//            xReturnCode = MQTT_AGENT_Delete( xMQTTHandle );
//            xMQTTHandle = NULL;
//            configPRINTF( ( "MQTT Client Deleted.\r\n" ) );
//            ( void ) xTaskCreate( prvMQTTConnectAndPublishTask,		/* The function that implements the demo task. */
//                          "MQTTDemo",                                   /* The name to assign to the task being created. */
//                          democonfigMQTT_ECHO_TASK_STACK_SIZE,		/* The size, in WORDS (not bytes), of the stack to allocate for the task being created. */
//                          NULL,                                         /* The task parameter is not being used. */
//                          democonfigMQTT_ECHO_TASK_PRIORITY,		/* The priority at which the task being created will run. */
//                          NULL );                                       /* Not storing the task's handle. */
//            break;
//
//        case eMQTTAgentPublish:
//            configPRINTF( ( "WARN: Should not have been called as we are registering topic specific callbacks.\r\n" ) );
//            break;
//    }
//
//    /* We do not want to take the ownership of buffers in any case. */
//    return xTakeOwnership;
//}
//
///*-----------------------------------------------------------*/
//
//static BaseType_t prvCreateClientAndConnectToBroker( void )
//{
//    MQTTAgentReturnCode_t xReturned;
//    BaseType_t xReturn = pdFAIL;
//
//    MQTTAgentConnectParams_t xConnectParameters = 
//    {
//        (const char *)clientcredentialMQTT_BROKER_ENDPOINT, /* The URL of the MQTT broker to connect to. */
//        pdTRUE,                                             /* Set to pdTRUE if the provided URL is an IP address, otherwise set to pdFALSE. */
//        clientcredentialMQTT_BROKER_PORT,                   /* Port number on which the MQTT broker is listening. */
//        CLIENT_ID,                                          /* Client Identifier of the MQTT client. It should be unique per broker. */
//        0,                                                  /* The length of the client Id, filled in later as not const. */
//        pdTRUE,                                             /* Set to pdTRUE to use TLS, pdFALSE to not use TLS. */
//        NULL,                                               /* User data supplied to the callback. Can be NULL. */
//        &( prvMQTTCallback ),                               /* Callback used to report various events. Can be NULL. */
//        (char *)GREENGRASS_CERTIFICATE_PEM,                 /* Certificate used for secure connection. Can be NULL. */
//        strlen((char *)GREENGRASS_CERTIFICATE_PEM) + 1      /* Size of certificate used for secure connection. */ /* include '\0' to length*/
//    };
//
//    /* Check this function has not already been executed. */
//    configASSERT( xMQTTHandle == NULL );
//
//    /* The MQTT client object must be created before it can be used.  The
//     * maximum number of MQTT client objects that can exist simultaneously
//     * is set by mqttconfigMAX_BROKERS. */
//    xReturned = MQTT_AGENT_Create( &xMQTTHandle );
//
//    if( xReturned == eMQTTAgentSuccess )
//    {
//        configPRINTF( ( "MQTT_AGENT_Create OK\r\n" ) );
//        /* Fill in the MQTTAgentConnectParams_t member that is not const,
//         * and therefore could not be set in the initializer (where
//         * xConnectParameters is declared in this function). */
//        xConnectParameters.usClientIdLength = ( uint16_t ) strlen( ( const char * )CLIENT_ID );
//
//        /* Connect to the broker. */
//        configPRINTF( ( "MQTT demo attempting to connect to %s.\r\n", clientcredentialMQTT_BROKER_ENDPOINT ) );
//        xReturned = MQTT_AGENT_Connect( xMQTTHandle,
//                                        &xConnectParameters,
//                                        democonfigMQTT_ECHO_TLS_NEGOTIATION_TIMEOUT );
//
//        if( xReturned != eMQTTAgentSuccess )
//        {
//            /* Could not connect, so delete the MQTT client. */
//            ( void ) MQTT_AGENT_Delete( xMQTTHandle );
//            configPRINTF( ( "ERROR:  MQTT demo failed to connect.\r\n" ) );
//        }
//        else
//        {
//            configPRINTF( ( "MQTT demo connected.\r\n" ) );
//            xReturn = pdPASS;
//        }
//    }
//
//    return xReturn;
//}
///*-----------------------------------------------------------*/
//
//BaseType_t prvPublishMessage( BaseType_t ButtonNum )
//{
//    MQTTAgentPublishParams_t xPublishParameters;
//    MQTTAgentReturnCode_t xReturned;
//    char cDataBuffer[ MAX_DATA_LENGTH ];
//
//    /* Check this function is not being called before the MQTT client object has
//     * been created. */
//    configASSERT( xMQTTHandle != NULL );
//
//    /* Create the message that will be published
//     * 0 - health message
//     * 1 .. 4 - number of button pressed on board */
//    ( void ) snprintf( cDataBuffer, MAX_DATA_LENGTH, "%d", ( int ) ButtonNum );
//
//    /* Setup the publish parameters. */
//    memset( &( xPublishParameters ), 0x00, sizeof( xPublishParameters ) );
//    xPublishParameters.pucTopic = TOPIC_NAME;
//    xPublishParameters.pvData = cDataBuffer;
//    xPublishParameters.usTopicLength = ( uint16_t ) strlen( ( const char * ) TOPIC_NAME );
//    xPublishParameters.ulDataLength = ( uint32_t ) strlen( cDataBuffer );
//    xPublishParameters.xQoS = eMQTTQoS0;
//
//    if(ButtonNum == 0)
//    {
//        xPublishParameters.pucTopic = TOPIC_NAME_HEALTH;
//        xPublishParameters.usTopicLength = ( uint16_t ) strlen( ( const char * ) TOPIC_NAME_HEALTH );
//    }
//
//    /* Publish the message. */
//    xReturned = MQTT_AGENT_Publish( xMQTTHandle,
//                                    &( xPublishParameters ),
//                                    democonfigMQTT_TIMEOUT );
//
//    if( xReturned == eMQTTAgentSuccess )
//    {
//        configPRINTF( ( "Message successfully published '%s'\r\n", cDataBuffer ) );
//    }
//    else
//    {
//        configPRINTF( ( "ERROR:  Message failed to publish '%s'\r\n", cDataBuffer ) );
//    }
//
//    return xReturned;
//}
///*-----------------------------------------------------------*/
//
///**@brief Publish task entry function.
// *
// * @param[in] pvParameter   Pointer that will be used as the parameter for the task.
// */
//static void prvPublishTask (void * pvParameter)
//{
//    UNUSED_PARAMETER(pvParameter);
//
//    /* Create the semaphore that is used to demonstrate a task being
//    synchronised with an interrupt. */
//    vSemaphoreCreateBinary( xPublicSemaphore );
//
//    while (true)
//    {    
//        xSemaphoreTake( xPublicSemaphore, portMAX_DELAY );
//
//        if(iButtonPressed)
//        {
//            if(iConnectionState)
//            {
//                if( xQueueSend( xQueueMsg, &iButtonPressed, 0 ) != pdPASS )
//                {
//                    configPRINTF( ( "ERROR prvPublishTask\r\n" ) );
//                    iConnectionState = 0;
//                }
//            }
//
//            iButtonPressed = 0;
//        }
//    }
//}
///*-----------------------------------------------------------*/
//
///**@brief Publish health task entry function.
// *
// * @param[in] pvParameter   Pointer that will be used as the parameter for the task.
// */
//static void prvHealthPublishTask (void * pvParameter)
//{
//    UNUSED_PARAMETER(pvParameter);
//
//    BaseType_t but = 0;
//
//    /* Create the semaphore that is used to demonstrate a task being
//    synchronised with an interrupt. */
//    while (true)
//    {    
//        if(iConnectionState)
//        {
//            if( xQueueSend( xQueueMsg, &but, 0 ) != pdPASS )
//            {
//                configPRINTF( ( "ERROR prvHealthPublishTask\r\n" ) );
//                iConnectionState = 0;
//            }
//        }
//        vTaskDelay(2000);
//    }
//}
///*-----------------------------------------------------------*/
//
///**@brief Queue task entry function.
// *
// * @param[in] pvParameter   Pointer that will be used as the parameter for the task.
// */
//static void prvSendToQueueTask (void * pvParameter)
//{
//    UNUSED_PARAMETER(pvParameter);
//
//    BaseType_t but;
//
//    for( ;; )
//    {
//        /* Block to wait for the next string to print. */
//        if( xQueueReceive( xQueueMsg, &but, portMAX_DELAY ) == pdPASS )
//        {
//            if(prvPublishMessage(but) != 0)
//            {
//                configPRINTF( ( "ERROR Publish MSG\r\n" ) );
//            }
//            /* xTimer2 make reset for device if messages is not sended during 5s */
//            nrf_drv_timer_clear(&xTimer2);
//        }
//        else
//        {
//            configPRINTF( ( "ERROR xQueueMsg\r\n" ) );
//        }
//    }
//}
///*-----------------------------------------------------------*/
//
//static void prvMQTTConnectAndPublishTask( void * pvParameters )
//{
//    BaseType_t x, xReturned;
//
//    /* Avoid compiler warnings about unused parameters. */
//    ( void ) pvParameters;
//
//    iLEDSState = eDeviceState_LEDS_MQTT_ConnectableMode;
//
//    /* Create the MQTT client object and connect it to the MQTT broker. */
//    xReturned = prvCreateClientAndConnectToBroker();
//
//    if( xReturned == pdPASS )
//    {
//        iLEDSState = eDeviceState_LEDS_MQTT_Connected;
//
//        configPRINTF( ( "MQTT demo test task created.\r\n" ) );
//
//        xQueueMsg = xQueueCreate( QUEUE_MSH_LENGTH, sizeof( BaseType_t ) );
//
//        if( xQueueMsg == NULL )
//        {
//            configPRINTF( ( "ERROR: xQueueMsg\r\n" ) );
//        }
//
//        /* Create task for sending messages to xQueueMsg */
//        UNUSED_VARIABLE(xTaskCreate(prvPublishTask, "Publish", configMINIMAL_STACK_SIZE, NULL, tskIDLE_PRIORITY+1, NULL));
//
//        /* Create task for sending health messages to xQueueMsg */
//        UNUSED_VARIABLE(xTaskCreate(prvHealthPublishTask, "Health", configMINIMAL_STACK_SIZE, NULL, tskIDLE_PRIORITY, NULL));
//
//        /* Create task for Publishing packets */
//        UNUSED_VARIABLE(xTaskCreate(prvSendToQueueTask, "Queue", configMINIMAL_STACK_SIZE * 3, NULL, tskIDLE_PRIORITY+2, NULL));
//    }
//    else
//    {
//        iLEDSState = eDeviceState_LEDS_MQTT_Disconnected;
//
//        configPRINTF( ( "ERROR: MQTT demo test task is not created.\r\n" ) );
//    }
//
//    vTaskDelete( NULL ); /* Delete this task. */
//}
///*-----------------------------------------------------------*/
//
//void vStartMQTTDemo( void )
//{
//    configPRINTF( ( "Creating MQTT Demo Task...\r\n" ) );
//
//    /* Create the task that publishes messages to the MQTT broker every five
//     * seconds.  This task, in turn, creates the task that echoes data received
//     * from the broker back to the broker. */
//    ( void ) xTaskCreate( prvMQTTConnectAndPublishTask,        /* The function that implements the demo task. */
//                          "MQTTDemo",                          /* The name to assign to the task being created. */
//                          democonfigMQTT_ECHO_TASK_STACK_SIZE, /* The size, in WORDS (not bytes), of the stack to allocate for the task being created. */
//                          NULL,                                /* The task parameter is not being used. */
//                          democonfigMQTT_ECHO_TASK_PRIORITY,   /* The priority at which the task being created will run. */
//                          NULL );                              /* Not storing the task's handle. */
//}
///*-----------------------------------------------------------*/
